# WORD TO NUMBER

# Importing Libraries

In [6]:
import pandas as pd
from word2number import w2n
num=pd.read_excel(r"C:\Users\WELCOME\Documents\Data Science\Word to Number.xlsx")
num

     number_name
0            one
1            two
2          three
3  seventy seven
4   eighty eight
5     ninty nine
6        hundred
7      fifty six
8     sixty nine
9    twenty four

# Conversion of numbers

In [8]:
num['number_name']=num['number_name'].apply(w2n.word_to_num)
num

   number_name
0            1
1            2
2            3
3           77
4           88
5            9
6          100
7           56
8           69
9           24